FormCodeGenerator/src/ExternalDataProcessors/FormGenerator/FormGenerator.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>FormGenerator</name>
  <attributes>
    <name>ИмяМодуля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПрограммногоДобавления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоФорм</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоРеквизитов</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВоВременномХранилище</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПодключеннойОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВременногоФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйПутьКФорме</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоЭлементов</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДобавленияРеквизитов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаКоманд</name>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСоздания</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

FormCodeGenerator/src/ExternalDataProcessors/FormGenerator/ObjectModule.bsl
Процедура ПодготовитьДанныеАнализируемойФормы(Форма) Экспорт
	
	Если Форма.Параметры.Свойство("РедакторФорм") Тогда
		
		НастройкиРедакторФорм = Форма.Параметры.РедакторФорм;
		ПараметрыРедакторФорм = ПолучитьИзВременногоХранилища(НастройкиРедакторФорм.АдресВоВременномХранилище);
		
		СформироватьДеревоСРеквизитамиФормы(ПараметрыРедакторФорм.ДеревоРеквизитов, "", Форма, Форма);
		
		ЗначениеВФайл(НастройкиРедакторФорм.ИмяВременногоФайла, ПараметрыРедакторФорм);
		 				
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура СформироватьДеревоСРеквизитамиФормы(ДеревоРеквизитов, ТекущийПуть, Форма,ТекущийОбъект) Экспорт
	
	КоллекцияРеквизитов = Форма.ПолучитьРеквизиты(ТекущийПуть);
	
	Для каждого ТекРеквизит Из КоллекцияРеквизитов Цикл
		
		НоваяСтрока = ДеревоРеквизитов.Строки.Добавить();
		НоваяСтрока.Имя = ТекРеквизит.Имя;
		НоваяСтрока.Тип = Строка(ТекРеквизит.ТипЗначения);
		
		ТипРеквизита = СтроковоеПредставлениеОписанияТипа(ТекРеквизит.ТипЗначения);
		
		НоваяСтрока.ТекстСоздания = "// ******   "+ТипЗнч(ТекРеквизит)+" """+ТекРеквизит.Имя+"""    ***********"+Символы.ПС+Символы.ПС+
		
		"НовыйРеквизит = Новый РеквизитФормы("""+ТекРеквизит.Имя+""","+ТипРеквизита+");";
		
		Если ЗначениеЗаполнено(ТекРеквизит.Путь) Тогда
			НоваяСтрока.ТекстСоздания = НоваяСтрока.ТекстСоздания+"
			|НовыйРеквизит.Путь = """+ТекРеквизит.Путь+""";";
		КонецЕсли; 
		
		НоваяСтрока.ТекстСоздания = НоваяСтрока.ТекстСоздания+"
		|НовыйРеквизит.Заголовок = """+ТекРеквизит.Заголовок+""";
		|НовыйРеквизит.СохраняемыеДанные = "+ТекстовоеПредставлениеЗначения(ТекРеквизит.СохраняемыеДанные)+";";
		
		Если (ТипЗнч(ТекущийОбъект)=Тип("ДанныеФормыСтруктура") ИЛИ ТипЗнч(ТекущийОбъект)=Тип("УправляемаяФорма"))
		 //  И СтруктураПутейКРеквизитам.Свойство(СтрЗаменить(ТекРеквизит.Путь+ТекРеквизит.Имя,".",""))
		    Тогда
			СформироватьДеревоСРеквизитамиФормы(НоваяСтрока,?(ЗначениеЗаполнено(ТекущийПуть),ТекущийПуть+".","")+ТекРеквизит.Имя,Форма,ТекущийОбъект[ТекРеквизит.Имя]);
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ПоместитьПустыеДанныеВХранилище() Экспорт
	
	СохраненноеДеревоЭлементов = ЭтотОбъект.ДеревоЭлементов.Скопировать();
	СохраненноеДеревоЭлементов.Строки.Очистить();
	СохраненноеДеревоРеквизитов = ЭтотОбъект.ДеревоРеквизитов.Скопировать();
	СохраненноеДеревоРеквизитов.Строки.Очистить();
	СохраненнаяТаблицаКоманд = ЭтотОбъект.ТаблицаКоманд.ВыгрузитьКолонки();
	
	СоответствиеТекстовыхПредставлений = НовоеСоответствиеТекстовыхПредставлений();
	СоответствиеПредставленийТипов = НовоеСоответствиеПредставленийТипов();
	
	ПараметрыДекомпиляции = Новый Структура;
	ПараметрыДекомпиляции.Вставить("СоответствиеТекстовыхПредставлений", СоответствиеТекстовыхПредставлений);
	ПараметрыДекомпиляции.Вставить("СоответствиеПредставленийТипов", СоответствиеПредставленийТипов);
	ПараметрыДекомпиляции.Вставить("ДеревоРеквизитов", СохраненноеДеревоРеквизитов);	
	ПараметрыДекомпиляции.Вставить("ДеревоЭлементов", СохраненноеДеревоЭлементов);
	ПараметрыДекомпиляции.Вставить("ТаблицаКоманд", СохраненнаяТаблицаКоманд);
	
	ЭтотОбъект.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыДекомпиляции,ЭтотОбъект.АдресВоВременномХранилище);
	ЭтотОбъект.ИмяПодключеннойОбработки = ЭтотОбъект.ИспользуемоеИмяФайла;
	ЭтотОбъект.ИмяВременногоФайла = ПолучитьИмяВременногоФайла(); 
	
КонецПроцедуры

Функция НовоеСоответствиеТекстовыхПредставлений() Экспорт
	
	СоответствиеТекстовыхПредставлений = Новый Соответствие;
		
	СоответствиеТекстовыхПредставлений.Вставить(Истина, "Истина");
	СоответствиеТекстовыхПредставлений.Вставить(Ложь, "Ложь");
	
	//ВертикальноеПоложениеЭлемента
	СоответствиеТекстовыхПредставлений.Вставить(ВертикальноеПоложениеЭлемента.Авто,"ВертикальноеПоложениеЭлемента.Авто");
	СоответствиеТекстовыхПредставлений.Вставить(ВертикальноеПоложениеЭлемента.Верх,"ВертикальноеПоложениеЭлемента.Верх");
	СоответствиеТекстовыхПредставлений.Вставить(ВертикальноеПоложениеЭлемента.Низ,"ВертикальноеПоложениеЭлемента.Низ");
	СоответствиеТекстовыхПредставлений.Вставить(ВертикальноеПоложениеЭлемента.Центр,"ВертикальноеПоложениеЭлемента.Центр");
	
	//ВидГруппаФормы
	СоответствиеТекстовыхПредставлений.Вставить(ВидГруппыФормы.ГруппаКнопок,"ВидГруппыФормы.ГруппаКнопок");
	СоответствиеТекстовыхПредставлений.Вставить(ВидГруппыФормы.ГруппаКолонок,"ВидГруппыФормы.ГруппаКолонок");
	СоответствиеТекстовыхПредставлений.Вставить(ВидГруппыФормы.КоманднаяПанель,"ВидГруппыФормы.КоманднаяПанель");
	СоответствиеТекстовыхПредставлений.Вставить(ВидГруппыФормы.КонтекстноеМеню,"ВидГруппыФормы.КонтекстноеМеню");
	СоответствиеТекстовыхПредставлений.Вставить(ВидГруппыФормы.ОбычнаяГруппа,"ВидГруппыФормы.ОбычнаяГруппа");
	СоответствиеТекстовыхПредставлений.Вставить(ВидГруппыФормы.Подменю,"ВидГруппыФормы.Подменю");
	СоответствиеТекстовыхПредставлений.Вставить(ВидГруппыФормы.Страница,"ВидГруппыФормы.Страница");
	СоответствиеТекстовыхПредставлений.Вставить(ВидГруппыФормы.Страницы,"ВидГруппыФормы.Страницы");
	
	//ВидДекорацииФормы
	СоответствиеТекстовыхПредставлений.Вставить(ВидДекорацииФормы.Картинка,"ВидДекорацииФормы.Картинка");
	СоответствиеТекстовыхПредставлений.Вставить(ВидДекорацииФормы.Надпись,"ВидДекорацииФормы.Надпись");
	
	//ВидКнопкиФормы
	СоответствиеТекстовыхПредставлений.Вставить(ВидКнопкиФормы.Гиперссылка,"ВидКнопкиФормы.Гиперссылка");
	СоответствиеТекстовыхПредставлений.Вставить(ВидКнопкиФормы.КнопкаКоманднойПанели,"ВидКнопкиФормы.КнопкаКоманднойПанели");
	СоответствиеТекстовыхПредставлений.Вставить(ВидКнопкиФормы.ОбычнаяКнопка,"ВидКнопкиФормы.ОбычнаяКнопка");
	
	//ВидПоляФормы
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеHTMLДокумента,"ВидПоляФормы.ПолеHTMLДокумента");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеВвода,"ВидПоляФормы.ПолеВвода");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеГеографическойСхемы,"ВидПоляФормы.ПолеГеографическойСхемы");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеГрафическойСхемы,"ВидПоляФормы.ПолеГрафическойСхемы");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеДендрограммы,"ВидПоляФормы.ПолеДендрограммы");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеДиаграммы,"ВидПоляФормы.ПолеДиаграммы");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеДиаграммыГанта,"ВидПоляФормы.ПолеДиаграммыГанта");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеКалендаря,"ВидПоляФормы.ПолеКалендаря");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеИндикатора,"ВидПоляФормы.ПолеИндикатора");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеКартинки,"ВидПоляФормы.ПолеКартинки");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеНадписи,"ВидПоляФормы.ПолеНадписи");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеПереключателя,"ВидПоляФормы.ПолеПереключателя");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеПериода,"ВидПоляФормы.ПолеПериода");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеПолосыРегулирования,"ВидПоляФормы.ПолеПолосыРегулирования");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеТабличногоДокумента,"ВидПоляФормы.ПолеТабличногоДокумента");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеТекстовогоДокумента,"ВидПоляФормы.ПолеТекстовогоДокумента");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеФлажка,"ВидПоляФормы.ПолеФлажка");
	СоответствиеТекстовыхПредставлений.Вставить(ВидПоляФормы.ПолеФорматированногоДокумента,"ВидПоляФормы.ПолеФорматированногоДокумента");
	
	//ГоризонтальноеПоложениеЭлемента
	СоответствиеТекстовыхПредставлений.Вставить(ГоризонтальноеПоложениеЭлемента.Авто,"ГоризонтальноеПоложениеЭлемента.Авто");
	СоответствиеТекстовыхПредставлений.Вставить(ГоризонтальноеПоложениеЭлемента.Лево,"ГоризонтальноеПоложениеЭлемента.Лево");
	СоответствиеТекстовыхПредставлений.Вставить(ГоризонтальноеПоложениеЭлемента.Право,"ГоризонтальноеПоложениеЭлемента.Право");
	СоответствиеТекстовыхПредставлений.Вставить(ГоризонтальноеПоложениеЭлемента.Центр,"ГоризонтальноеПоложениеЭлемента.Центр");
	
	//ГруппировкаПодчиненныхЭлементовФормы
	СоответствиеТекстовыхПредставлений.Вставить(ГруппировкаПодчиненныхЭлементовФормы.Вертикальная,"ГруппировкаПодчиненныхЭлементовФормы.Вертикальная");
	СоответствиеТекстовыхПредставлений.Вставить(ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная,"ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная");
	
	//ИспользованиеВывода
	СоответствиеТекстовыхПредставлений.Вставить(ИспользованиеВывода.Авто,"ИспользованиеВывода.Авто");
	СоответствиеТекстовыхПредставлений.Вставить(ИспользованиеВывода.Запретить,"ИспользованиеВывода.Запретить");
	СоответствиеТекстовыхПредставлений.Вставить(ИспользованиеВывода.Разрешить,"ИспользованиеВывода.Разрешить");
	
	//ИспользованиеПолосыПрокрутки
	СоответствиеТекстовыхПредставлений.Вставить(ИспользованиеПолосыПрокрутки.ИспользоватьАвтоматически,"ИспользованиеПолосыПрокрутки.ИспользоватьАвтоматически");
	СоответствиеТекстовыхПредставлений.Вставить(ИспользованиеПолосыПрокрутки.ИспользоватьВсегда,"ИспользованиеПолосыПрокрутки.ИспользоватьВсегда");
	СоответствиеТекстовыхПредставлений.Вставить(ИспользованиеПолосыПрокрутки.НеИспользовать,"ИспользованиеПолосыПрокрутки.НеИспользовать");
	
	//НачальноеОтображениеДерева
	СоответствиеТекстовыхПредставлений.Вставить(НачальноеОтображениеДерева.НеРаскрывать,"НачальноеОтображениеДерева.НеРаскрывать");
	СоответствиеТекстовыхПредставлений.Вставить(НачальноеОтображениеДерева.РаскрыватьВерхнийУровень,"НачальноеОтображениеДерева.РаскрыватьВерхнийУровень");
	СоответствиеТекстовыхПредставлений.Вставить(НачальноеОтображениеДерева.РаскрыватьВсеУровни,"НачальноеОтображениеДерева.РаскрыватьВсеУровни");
	
	//НачальноеОтображениеСписка
	СоответствиеТекстовыхПредставлений.Вставить(НачальноеОтображениеСписка.Авто,"НачальноеОтображениеСписка.Авто");
	СоответствиеТекстовыхПредставлений.Вставить(НачальноеОтображениеСписка.Конец,"НачальноеОтображениеСписка.Конец");
	СоответствиеТекстовыхПредставлений.Вставить(НачальноеОтображениеСписка.Начало,"НачальноеОтображениеСписка.Начало");
	
	//ОтображениеКнопки
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеКнопки.Авто,"ОтображениеКнопки.Авто");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеКнопки.Картинка,"ОтображениеКнопки.Картинка");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеКнопки.КартинкаИТекст,"ОтображениеКнопки.КартинкаИТекст");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеКнопки.Текст,"ОтображениеКнопки.Текст");
	
	//ОтображениеОбычнойГруппы
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеОбычнойГруппы.Нет,"ОтображениеОбычнойГруппы.Нет");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеОбычнойГруппы.ОбычноеВыделение,"ОтображениеОбычнойГруппы.ОбычноеВыделение");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеОбычнойГруппы.СильноеВыделение,"ОтображениеОбычнойГруппы.СильноеВыделение");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеОбычнойГруппы.СлабоеВыделение,"ОтображениеОбычнойГруппы.СлабоеВыделение");
	
	//ОтображениеПодсказки
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеПодсказки.Авто,"ОтображениеПодсказки.Авто");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеПодсказки.Всплывающая,"ОтображениеПодсказки.Всплывающая");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеПодсказки.Кнопка,"ОтображениеПодсказки.Кнопка");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеПодсказки.Нет,"ОтображениеПодсказки.Нет");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеПодсказки.ОтображатьАвто,"ОтображениеПодсказки.ОтображатьАвто");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеПодсказки.ОтображатьСверху,"ОтображениеПодсказки.ОтображатьСверху");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеПодсказки.ОтображатьСлева,"ОтображениеПодсказки.ОтображатьСлева");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеПодсказки.ОтображатьСнизу,"ОтображениеПодсказки.ОтображатьСнизу");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеПодсказки.ОтображатьСправа,"ОтображениеПодсказки.ОтображатьСправа");
	
	//ОтображениеТаблицы
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеТаблицы.Дерево,"ОтображениеТаблицы.Дерево");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеТаблицы.ИерархическийСписок,"ОтображениеТаблицы.ИерархическийСписок");
	СоответствиеТекстовыхПредставлений.Вставить(ОтображениеТаблицы.Список,"ОтображениеТаблицы.Список");
	
	//ПоведениеОбычнойГруппы
	СоответствиеТекстовыхПредставлений.Вставить(ПоведениеОбычнойГруппы.Обычное,"ПоведениеОбычнойГруппы.Обычное");
	СоответствиеТекстовыхПредставлений.Вставить(ПоведениеОбычнойГруппы.Свертываемая,"ПоведениеОбычнойГруппы.Свертываемая");
	
	//ПоложениеЗаголовкаЭлементаФормы
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеЗаголовкаЭлементаФормы.Авто,"ПоложениеЗаголовкаЭлементаФормы.Авто");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеЗаголовкаЭлементаФормы.Верх,"ПоложениеЗаголовкаЭлементаФормы.Верх");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеЗаголовкаЭлементаФормы.Лево,"ПоложениеЗаголовкаЭлементаФормы.Лево");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеЗаголовкаЭлементаФормы.Нет,"ПоложениеЗаголовкаЭлементаФормы.Нет");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеЗаголовкаЭлементаФормы.Низ,"ПоложениеЗаголовкаЭлементаФормы.Низ");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеЗаголовкаЭлементаФормы.Право,"ПоложениеЗаголовкаЭлементаФормы.Право");
	
	//ПоложениеКоманднойПанелиЭлементаФормы
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеКоманднойПанелиЭлементаФормы.Авто,"ПоложениеКоманднойПанелиЭлементаФормы.Авто");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеКоманднойПанелиЭлементаФормы.Верх,"ПоложениеКоманднойПанелиЭлементаФормы.Верх");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеКоманднойПанелиЭлементаФормы.Нет,"ПоложениеКоманднойПанелиЭлементаФормы.Нет");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеКоманднойПанелиЭлементаФормы.Низ,"ПоложениеКоманднойПанелиЭлементаФормы.Низ");
	
	//ПоложениеСостоянияПросмотра	
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеСостоянияПросмотра.Авто,"ПоложениеСостоянияПросмотра.Авто");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеСостоянияПросмотра.Верх,"ПоложениеСостоянияПросмотра.Верх");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеСостоянияПросмотра.Нет,"ПоложениеСостоянияПросмотра.Нет");
	СоответствиеТекстовыхПредставлений.Вставить(ПоложениеСостоянияПросмотра.Низ,"ПоложениеСостоянияПросмотра.Низ");
	
	//РежимВводаСтрокТаблицы
	СоответствиеТекстовыхПредставлений.Вставить(РежимВводаСтрокТаблицы.ВКонецОкна,"РежимВводаСтрокТаблицы.ВКонецОкна");
	СоответствиеТекстовыхПредставлений.Вставить(РежимВводаСтрокТаблицы.ВКонецСписка,"РежимВводаСтрокТаблицы.ВКонецСписка");
	СоответствиеТекстовыхПредставлений.Вставить(РежимВводаСтрокТаблицы.ПередТекущейСтрокой,"РежимВводаСтрокТаблицы.ПередТекущейСтрокой");
	СоответствиеТекстовыхПредставлений.Вставить(РежимВводаСтрокТаблицы.ПослеТекущейСтроки,"РежимВводаСтрокТаблицы.ПослеТекущейСтроки");
	
	//РежимВыделенияТаблицы
	СоответствиеТекстовыхПредставлений.Вставить(РежимВыделенияТаблицы.Множественный,"РежимВыделенияТаблицы.Множественный");
	СоответствиеТекстовыхПредставлений.Вставить(РежимВыделенияТаблицы.Одиночный,"РежимВыделенияТаблицы.Одиночный");
	
	//РежимВыделенияСтрокиТаблицы
	СоответствиеТекстовыхПредставлений.Вставить(РежимВыделенияСтрокиТаблицы.Строка,"РежимВыделенияСтрокиТаблицы.Строка");
	СоответствиеТекстовыхПредставлений.Вставить(РежимВыделенияСтрокиТаблицы.Ячейка,"РежимВыделенияСтрокиТаблицы.Ячейка");
	
	Возврат СоответствиеТекстовыхПредставлений;
	
КонецФункции

Функция НовоеСоответствиеПредставленийТипов() Экспорт
	
	СоответствиеПредставленийТипов = Новый Соответствие;
	
	МассивДопустимыхТипов = ДопустимыеТипы();
	
	Для каждого ПредставлениеТипа Из МассивДопустимыхТипов Цикл
		СоответствиеПредставленийТипов.Вставить(Тип(ПредставлениеТипа),ПредставлениеТипа);
	КонецЦикла; 
	
	Возврат СоответствиеПредставленийТипов;
		
КонецФункции

Функция ДопустимыеТипы()

	МассивТипов = Новый Массив;
	МассивТипов.Добавить("Число");
	МассивТипов.Добавить("Строка");
	МассивТипов.Добавить("Булево");
	МассивТипов.Добавить("Дата");
	МассивТипов.Добавить("СписокЗначений");
	МассивТипов.Добавить("МоментВремени");
	
	
	МассивТипов.Добавить("ДинамическийСписок");
	МассивТипов.Добавить("Картинка");
	
	МассивТипов.Добавить("ПолеФормы");
	МассивТипов.Добавить("ГруппаФормы");
	МассивТипов.Добавить("ТаблицаФормы");
	МассивТипов.Добавить("ДекорацияФормы");
	МассивТипов.Добавить("КнопкаФормы");
	
	МассивТипов.Добавить("ТаблицаЗначений");
	МассивТипов.Добавить("ДеревоЗначений");
	
	МассивТипов.Добавить("ПорядокКомпоновкиДанных");
	МассивТипов.Добавить("ОтборКомпоновкиДанных");
	МассивТипов.Добавить("ПоляГруппировкиКомпоновкиДанных");
	МассивТипов.Добавить("УсловноеОформлениеКомпоновкиДанных");
	
	Для каждого Документ Из Метаданные.Документы Цикл
		МассивТипов.Добавить("ДокументСсылка."+Документ.Имя);	
	КонецЦикла; 
	Для каждого Справочник Из Метаданные.Справочники Цикл
		МассивТипов.Добавить("СправочникСсылка."+Справочник.Имя);	
	КонецЦикла; 
	Для каждого Перечисление Из Метаданные.Перечисления Цикл
		МассивТипов.Добавить("ПеречислениеСсылка."+Перечисление.Имя);	
	КонецЦикла; 
	
	Возврат МассивТипов;
	
КонецФункции // ПолучитьДопустимыеТипы()

Функция ПолучитьСтроковоеПредставлениеТипа(ПроверяемыйТип)
	
	ПредставлениеТипа = НовоеСоответствиеПредставленийТипов().Получить(ПроверяемыйТип);
	
	Если ПредставлениеТипа = Неопределено Тогда
	    //Сообщить("Не определен тип "+ПроверяемыйТип);
	КонецЕсли; 
	
	Возврат ПредставлениеТипа;
	
КонецФункции

Функция СтроковоеПредставлениеОписанияТипа(ПроверяемоеОписаниеТипов)
	
	Если ПроверяемоеОписаниеТипов.Типы().Количество() > 0 Тогда
		Возврат "Новый ОписаниеТипов("""+ПолучитьСтроковоеПредставлениеТипа(ПроверяемоеОписаниеТипов.Типы()[0])+""")";
	Иначе
	    Возврат "Неопределено";
	КонецЕсли; 
	
КонецФункции

Функция ТекстовоеПредставлениеЗначения(Значение)
	
	//Для текстовых значений добавляем кавычки в вывод
	//для нетекстовых получаем текстовое представление значения свойства
	ПредставлениеЗначения = Неопределено;
	Если Значение = Неопределено Тогда
		ПредставлениеЗначения = "Неопределено";
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		ПредставлениеЗначения = """"+Значение+"""";
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		ПредставлениеЗначения = Формат(Значение,"ЧН=; ЧГ=0");
	ИначеЕсли ТипЗнч(Значение) = Тип("Шрифт")
		ИЛИ ТипЗнч(Значение) = Тип("Цвет") Тогда
		ПредставлениеЗначения = ТекстовоеПредставлениеСложногоТипа(Значение)
	Иначе	
		ПредставлениеЗначения = НовоеСоответствиеТекстовыхПредставлений().Получить(Значение);
	КонецЕсли; 
	
	Возврат ПредставлениеЗначения;
	
КонецФункции

Функция ТекстовоеПредставлениеСложногоТипа(Значение)
	
	ПредставлениеТипа = Неопределено;
	Если ТипЗнч(Значение) = Тип("Шрифт") Тогда
		Если Значение.Вид = ВидШрифта.АвтоШрифт Тогда 
			ПредставлениеТипа = "Новый Шрифт()";
		Иначе 
			ИмяШрифта = """"+Значение.Имя+"""";
			Размер = ТекстовоеПредставлениеЗначения(Значение.Размер);
			Жирный = ТекстовоеПредставлениеЗначения(Значение.Жирный);
			Наклонный = ТекстовоеПредставлениеЗначения(Значение.Наклонный);
			Подчеркивание = ТекстовоеПредставлениеЗначения(Значение.Подчеркивание);
			Зачеркивание = ТекстовоеПредставлениеЗначения(Значение.Зачеркивание);
			Масштаб = ТекстовоеПредставлениеЗначения(Значение.Масштаб);
			ПредставлениеТипа = "Новый Шрифт("+ИмяШрифта+","+Размер+","+Жирный+","+Наклонный+","+Подчеркивание+","+Зачеркивание+","+Масштаб+")";	
		КонецЕсли;	
	ИначеЕсли ТипЗнч(Значение) = Тип("Цвет") Тогда
		Если Значение.Вид = ВидЦвета.АвтоЦвет Тогда 
			ПредставлениеТипа = "Новый Цвет()";
		Иначе 
			ПредставлениеТипа = "Новый Цвет("+Значение.Красный+","+Значение.Зеленый+","+Значение.Синий+")";	
		КонецЕсли;	
	Иначе
		//Сюда мы попадать не должны.
		//Функцию вызвали для неподдерживаемого типа
		Сообщить("ПолучитьТекстовоеПредставлениеСложногоТипа:"+ТипЗнч(Значение))
	КонецЕсли; 
	
	Возврат ПредставлениеТипа;
	
КонецФункции 
#КонецОбласти
